<?php
include_once "db-inc.php";

//连接MYSQL
$link = db_init_connect();

//检查数据库是否存在，如果存在则重建
$query = 'DROP DATABASE IF EXISTS ' . DATABASE;
mysqli_query($link, $query);
$query = 'CREATE DATABASE ' . DATABASE;
mysqli_query($link, $query);

//连接到指定数据库
mysqli_select_db($link, DATABASE);

//赋值表名
$user_password_table = STUDENT_ACCOUNT_TABLE;
$student_table = STUDENT_TABLE;
$teacher_table = TEACHER_TABLE;
$team_table = TEAM_TABLE;
$activity_table = ACTIVITY_TABLE;
$achievement_table = ACHIEVEMENT_TABLE;
$student_team_table = STUDENT_TEAM_TABLE;

$query = <<<STRING
CREATE TABLE $student_table 
( 
    `id` BIGINT NOT NULL , 
    `name` VARCHAR(20) NOT NULL , 
    `sex` CHAR(1) NOT NULL CHECK(sex IN ('男', '女')) , 
    `age` INT NOT NULL , 
    PRIMARY KEY (`id`)
)
ENGINE = InnoDB;

CREATE TABLE $user_password_table 
(
    `id` BIGINT NOT NULL , 
    `password` VARCHAR(30) NOT NULL DEFAULT 'password' ,
    PRIMARY KEY (`id`) ,
    FOREIGN KEY (`id`) REFERENCES $student_table(`id`) ON DELETE CASCADE ON UPDATE CASCADE
)
ENGINE = InnoDB;

CREATE TABLE $teacher_table
( 
    `id` BIGINT NOT NULL , 
    `name` VARCHAR(20) NOT NULL , 
    `sex` CHAR(1) NOT NULL CHECK(sex IN ('男', '女')) , 
    `age` INT NOT NULL , 
    PRIMARY KEY (`id`)
)
ENGINE = InnoDB;

CREATE TABLE $team_table 
( 
    `id` BIGINT NOT NULL , 
    `name` VARCHAR(30) NOT NULL , 
    `num` INT NOT NULL , 
    PRIMARY KEY (`id`)
) 
ENGINE = InnoDB;

CREATE TABLE $activity_table 
( 
    `id` BIGINT NOT NULL , 
    `name` VARCHAR(30) NOT NULL , 
    PRIMARY KEY (`id`)
) 
ENGINE = InnoDB;

CREATE TABLE $achievement_table 
( 
    `team_id` BIGINT NOT NULL , 
    `activity_id` BIGINT NOT NULL , 
    `time` DATE NOT NULL , 
    `teacher_id` BIGINT NOT NULL , 
    `academy` VARCHAR(30) NOT NULL , 
    PRIMARY KEY (`team_id`, `activity_id`) ,
    FOREIGN KEY (`team_id`) REFERENCES $team_table(`id`) ,
    FOREIGN KEY (`activity_id`) REFERENCES $activity_table(`id`) ,
    FOREIGN KEY (`teacher_id`) REFERENCES $teacher_table(`id`)
) 
ENGINE = InnoDB;

CREATE TABLE $student_team_table 
( 
    `student_id` BIGINT NOT NULL , 
    `team_id` BIGINT NOT NULL , 
    PRIMARY KEY (`student_id`, `team_id`) ,
    FOREIGN KEY (`student_id`) REFERENCES $student_table(`id`) ,
    FOREIGN KEY (`team_id`) REFERENCES $team_table(`id`)
) 
ENGINE = InnoDB;

INSERT
INTO `student`(`id`, `name`, `sex`, `age`)
VALUES
("10000001","王生安","男","22"),
("10000002","李鑫灏","女","28"),
("10000003","薛佛世","男","28"),
("10000004","蔡壮保","男","25"),
("10000005","钱勤堃","男","27"),
("10000006","潘恩依","女","26"),
("10000007","陈国柏","女","23"),
("10000008","魏皑虎","女","19"),
("10000009","周卓浩","女","17"),
("10000010","汤辟邦","女","18"),
("10000011","张顺谷","女","21"),
("10000012","张悌斯","女","25"),
("10000013","张灶冲","女","20"),
("10000014","易江维","女","22"),
("10000015","孙来笙","女","18"),
("10000016","饶展林","女","21"),
("10000017","岳列洋","男","29"),
("10000018","时党舒","女","22"),
("10000019","周迟蒲","男","27"),
("10000020","廉梦容","男","25"),
("10000021","张淮森","女","23"),
("10000022","夏劲釜","男","30"),
("10000023","王好隐","女","27"),
("10000024","刘昼星","男","30"),
("10000025","池荣弈","男","17"),
("10000026","邹包幼","男","29"),
("10000027","王施峪","女","22"),
("10000028","武慎萌","男","22"),
("10000029","范千皋","男","23"),
("10000030","潘佩焱","男","21"),
("10000031","周逸依","女","26"),
("10000032","齐寒昇","男","23"),
("10000033","邱栾树","男","29"),
("10000034","卢钦钧","男","23"),
("10000035","文壮翔","男","29"),
("10000036","蔡沐壮","女","30"),
("10000037","唐盎正","男","21"),
("10000038","王腾振","男","25"),
("10000039","蔡容富","女","18"),
("10000040","宁雨御","女","26"),
("10000041","朱付流","男","17"),
("10000042","陆丛枫","男","20"),
("10000043","汤丞昱","女","24"),
("10000044","萧百徽","女","21"),
("10000045","田稻善","男","27"),
("10000046","莫立恩","女","22"),
("10000047","戚渊苏","女","18"),
("10000048","郭磊留","男","28"),
("10000049","邱靖祈","女","26"),
("10000050","刘鲜发","女","28"),
("10000051","李彩早","女","17"),
("10000052","卓互知","女","20"),
("10000053","岳繁粟","女","28"),
("10000054","莫两敬","男","19"),
("10000055","贺易","女","19"),
("10000056","岑贝澄","男","18"),
("10000057","陶臣杜","男","19"),
("10000058","卫惇琰","女","30"),
("10000059","王赫颢","男","28"),
("10000060","何刚名","女","18"),
("10000061","梁澄静","男","28"),
("10000062","卢全煦","女","28"),
("10000063","严席华","女","25"),
("10000064","张顺廉","男","29"),
("10000065","欧贡界","男","26"),
("10000066","汤始青","女","22"),
("10000067","张鸿鹤","男","29"),
("10000068","车亚忠","男","27"),
("10000069","龙璨禄","男","28"),
("10000070","柯纤翊","男","23"),
("10000071","池慕营","男","30"),
("10000072","吴登菘","女","30"),
("10000073","齐奋厦","男","23"),
("10000074","夏莱冶","男","17"),
("10000075","夏吏克","男","29"),
("10000076","殷蒙共","男","30"),
("10000077","齐聪纪","女","27"),
("10000078","金图康","女","21"),
("10000079","秦尝乐","男","25"),
("10000080","丘存心","男","30"),
("10000081","俞灶迟","女","28"),
("10000082","元感棋","女","29"),
("10000083","陆示笙","女","29"),
("10000084","简胜琰","男","23"),
("10000085","云介融","女","20"),
("10000086","梁夜翊","女","23"),
("10000087","成昀澄","女","27"),
("10000088","卞然倌","女","19"),
("10000089","林静育","男","25"),
("10000090","王成文","男","29");

INSERT
INTO $user_password_table(`id`, `password`)
VALUES
("10000001","password"),
("10000002","password"),
("10000003","password"),
("10000004","password"),
("10000005","password"),
("10000006","password"),
("10000007","password"),
("10000008","password"),
("10000009","password"),
("10000010","password"),
("10000011","password"),
("10000012","password"),
("10000013","password"),
("10000014","password"),
("10000015","password"),
("10000016","password"),
("10000017","password"),
("10000018","password"),
("10000019","password"),
("10000020","password"),
("10000021","password"),
("10000022","password"),
("10000023","password"),
("10000024","password"),
("10000025","password"),
("10000026","password"),
("10000027","password"),
("10000028","password"),
("10000029","password"),
("10000030","password"),
("10000031","password"),
("10000032","password"),
("10000033","password"),
("10000034","password"),
("10000035","password"),
("10000036","password"),
("10000037","password"),
("10000038","password"),
("10000039","password"),
("10000040","password"),
("10000041","password"),
("10000042","password"),
("10000043","password"),
("10000044","password"),
("10000045","password"),
("10000046","password"),
("10000047","password"),
("10000048","password"),
("10000049","password"),
("10000050","password"),
("10000051","password"),
("10000052","password"),
("10000053","password"),
("10000054","password"),
("10000055","password"),
("10000056","password"),
("10000057","password"),
("10000058","password"),
("10000059","password"),
("10000060","password"),
("10000061","password"),
("10000062","password"),
("10000063","password"),
("10000064","password"),
("10000065","password"),
("10000066","password"),
("10000067","password"),
("10000068","password"),
("10000069","password"),
("10000070","password"),
("10000071","password"),
("10000072","password"),
("10000073","password"),
("10000074","password"),
("10000075","password"),
("10000076","password"),
("10000077","password"),
("10000078","password"),
("10000079","password"),
("10000080","password"),
("10000081","password"),
("10000082","password"),
("10000083","password"),
("10000084","password"),
("10000085","password"),
("10000086","password"),
("10000087","password"),
("10000088","password"),
("10000089","password"),
("10000090","password");

INSERT
INTO $teacher_table(id, name, sex, age)
VALUES
("20000000","张明活","男","30"),
("20000001","张京楚","男","31"),
("20000002","张意昌","男","32"),
("20000003","张瑞政","男","33"),
("20000004","张太展","男","34"),
("20000005","张原凡","男","35"),
("20000006","张彬华","男","36"),
("20000007","张鼐望","男","37"),
("20000008","张鼐奉","男","38"),
("20000009","张鹤镛","男","39"),
("20000010","张鲸念","男","40"),
("20000011","张鲸听","男","41"),
("20000012","张鲸双","男","42"),
("20000013","张鲁欲","男","43"),
("20000014","张鲁大","男","44"),
("20000015","张鲁之","男","45"),
("20000016","张骞通","男","46"),
("20000017","张骞西","男","47"),
("20000018","张骞至","男","48"),
("20000019","张骞复","男","49"),
("20000020","张首春","男","50"),
("20000021","张顺魂","男","51"),
("20000022","张顺引","男","52"),
("20000023","张顺大","男","53"),
("20000024","张镇芳","男","54"),
("20000025","张钟俊","男","55"),
("20000026","张金称","男","56"),
("20000027","张金牙","男","57"),
("20000028","李苏兴","男","50"),
("20000029","李亦修","男","49"),
("20000030","李沂修","男","48"),
("20000031","李伟尚","男","47"),
("20000032","李爱驰","男","46"),
("20000033","李爱池","男","45"),
("20000034","李二辉","男","44"),
("20000035","李竞生","男","43"),
("20000036","李超铉","男","42"),
("20000037","李尧进","男","41"),
("20000038","李尧锦","男","40"),
("20000039","李哲殷","男","39"),
("20000040","李沐特","男","38"),
("20000041","李宥熹","男","37"),
("20000042","李邦招","男","36"),
("20000043","李羡祺","男","35"),
("20000044","李红烈","男","34"),
("20000045","李龙眠","男","33"),
("20000046","李麦用","男","32"),
("20000047","李风念","男","31"),
("20000048","李雷道","男","30"),
("20000049","李雅勋","男","29"),
("20000050","李雄继","男","28"),
("20000051","李长白","男","27"),
("20000052","李钧德","男","26"),
("20000053","李重庵","男","25"),
("20000054","李遵顼","男","24"),
("20000055","李过见","男","23");
STRING;

$result = mysqli_multi_query($link, $query);

if($result == true) {
    echo '
    <script>
        alert("初始化成功");
    </script>';
}
else {
    echo '
    <script>
        alert("初始化失败，请再试一次");
    </script>';
}

echo '
<script>
    window.location.replace("../index.html");
</script>';
?>